Autodesk.Revit.DB.Structure.LoadBase.RemoveHostConstraint
Removes constraint from host for this load.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This LoadBase is not a constraint load.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
Thrown when the load is an AreaLoad and the host is an Analytical Panel with curved profile.

Autodesk.Revit.DB.Structure.LoadBase.HostElementId
The host element ID for the load.
Remarks:
If the load is hosted this is the id of the Analytical Element that hosts the load. If the load is not hosted, Autodesk.Revit.DB.ElementId.InvalidElementId is returned.
Since:
2015

Autodesk.Revit.DB.Structure.LoadBase.IsHosted
Indicates if the Load is hosted or non-hosted.
Remarks:
True is returned when load is hosted. False is returned load is non-hosted.
To determine if load is hosted Autodesk.Revit.DB.Structure.LoadBase.HostElementId property or
Autodesk::Revit::DB::Structure::LoadBase::HostElement property may also be used.
Since:
2016

Autodesk.Revit.DB.Structure.LoadBase.IsConstrainedOnHost
The load is constrained to host or not.

Autodesk.Revit.DB.Structure.LoadBase.LoadCaseId
The load case ID for the load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.Structure.LoadBase
The LoadBase object is the base class for all load objects within the Autodesk Revit API.
Data members
Remarks:
Load objects are only available in Autodesk Revit Structure. This object contains methods that are common to all other load objects.